export default function About() {
  return (
    <main>
      <div className="my-20 px-10 xl:px-32">
        <div className="bg-white px-5 py-10 rounded-md shadow-md">
          <h1 className="text-center text-3xl mb-8">เกี่ยวกับ</h1>
          <div className="py-10 lg:px-20 space-y-10">
            <p className="text-lg leading-relaxed">
              เว็บไซต์ซื้อ - ขาย
              แลกเปลี่ยนอุปกรณ์การเรียนของมหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา
              เชียงใหม่
              ถูกพัฒนาขึ้นมาเพื่อเป็นแพลตฟอร์มสำหรับนักศึกษาที่ต้องการซื้อหรือแลกเปลี่ยนอุปกรณ์การเรียนต่างๆ
              ไม่ว่าจะเป็นหนังสือเรียน, อุปกรณ์, เครื่องเขียน
              หรือแม้กระทั่งเครื่องมืออิเล็กทรอนิกส์ที่ใช้ในการเรียนการสอน
            </p>

            <p className="text-lg leading-relaxed">
              เว็บไซต์นี้มีจุดประสงค์ในการรวบรวมสินค้าจากแหล่งต่างๆ
              มารวมไว้ในที่เดียว
              เพื่อความสะดวกในการค้นหาสินค้าที่ต้องการและสามารถติดต่อกับผู้ขายได้อย่างรวดเร็ว
              นอกจากนี้ยังช่วยส่งเสริมการแบ่งปันและการแลกเปลี่ยนอุปกรณ์การเรียนกันภายในชุมชนของมหาวิทยาลัย
              ช่วยลดค่าใช้จ่ายและส่งเสริมให้เกิดการนำกลับมาใช้ใหม่ในกลุ่มนักศึกษา
            </p>

            <div>
              <h2 className="text-2xl mb-4">ฟีเจอร์ของเว็บไซต์</h2>
              <ul className="list-disc list-inside space-y-3">
                <li>ค้นหาสินค้า</li>
                <li>สร้างโพสต์ซื้อ-ขาย หรือแลกเปลี่ยนอุปกรณ์</li>
                <li>แสดงราคาสินค้าและข้อมูลสินค้า</li>
              </ul>
            </div>

            <div>
              <h2 className="text-2xl mb-4">ผู้พัฒนา</h2>
              <ul className="list-disc list-inside space-y-3">
                <li>นายกรณ์ดนัย ศรีสุริยานุรักษ์ เลขที่ 3</li>
                <li>นายณัฐภัทร สุระธง เลขที่ 6</li>
                <li>นายกฤษฎา วิริยา เลขที่ 22</li>
                <li>นายสุขสันต์ คำยา เลขที่ 30</li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    </main>
  );
}
